import React from 'react'

const skill = () => {
    return (
        <section id="skill">
            <div className="skill__inner">
                <div className="skill__title">
                    <h2>chanllenge <em>나의 도전</em></h2>
                </div>
                <div className="skill__desc">
                    <div>
                        <span>1.</span>
                        <h3>생각하기</h3>
                        <p>
                            복잡한 문제를 논리적으로 풀어 생각하는 능력
                            저는 복잡한 문제에 직면했을 때, 논리적으로 접근하고 여러 가지 방법을 고려하는 문제 해결 능력을 가지고 있으며, 어려운 과제에 도전하는 것을 두려워하지 않습니다. 궁금증을 해결하고 새로운 시각을 찾아내는 것을 즐기며, 항상 더 나은 방법을 찾는 열정을 가지고 있습니다.
                        </p>
                    </div>

                    <div>
                        <span>2.</span>
                        <h3>맞서기</h3>
                        <p>
                            어려운 문제가 있다면 피하지 않는 능력
                            코드와 알고리즘의 세계에서 모험하는 개발자입니다. 문제 해결을 즐기며, 새로운 기술을 통해 혁신적인 솔루션을 창조하는 것을 사랑합니다.

                        </p>
                    </div>

                    <div>
                        <span>3.</span>
                        <h3>해결하기</h3>
                        <p>
                            하나의 방법만이 아닌 여러가지의 방법을 생각해보고 궁금한 점이 있으면 참지못함
                            나는 기술적 도전에 힘겨움을 느끼지 않는 탐구자입니다. 복잡한 문제에 직면했을 때 논리적으로 접근하고, 단 하나의 해결책이 아니라 다양한 접근 방식을 고민합니다. 새로운 기술을 습득하는 것을 즐기며, 궁금한 것이 생기면 그 궁금증을 해결하려는 불타는 열정을 가지고 있습니다. 어려운 기술적 과제에 도전하는 것을 두려워하지 않으며, 항상 더 나은 방법과 혁신을 찾고자 노력합니다
                        </p>
                    </div>
                </div>
            </div>
        </section>
    )
}

export default skill